Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.inspector.plan.help.networkPlan.field.remoteContext
source: GitHub remote context: Issues, PRs, or other GitHub API resources with query and per-repo limits.
ar: سياق GitHub البعيد: المشكلات، طلبات السحب، أو موارد GitHub API الأخرى مع استعلام وحدود لكل مستودع.
de: GitHub-Remote-Kontext: Issues, PRs oder andere GitHub-API-Ressourcen mit Abfrage- und Pro-Repo-Limits.
es: Contexto remoto de GitHub: Issues, PRs u otros recursos de la API de GitHub con límites por consulta y por repositorio.
fr: Contexte distant GitHub : Issues, PRs ou autres ressources de l'API GitHub avec des limites par requête et par dépôt.
id: Konteks jarak jauh GitHub: Issues, PR, atau sumber daya API GitHub lainnya dengan kueri dan batas per repositori.
it: Contesto remoto GitHub: Issue, PR o altre risorse API GitHub con query e limiti per repository.
ja: GitHubリモートコンテキスト: Issue、PR、またはその他のGitHub APIリソース。クエリとリポジトリごとの制限があります。
ko: GitHub 원격 컨텍스트: 쿼리 및 저장소별 제한이 있는 이슈, PR 또는 기타 GitHub API 리소스입니다.
nl: GitHub externe context: Issues, PR's of andere GitHub API-bronnen met query- en per-repo-limieten.
pl: Zdalny kontekst GitHub: Issues, PR lub inne zasoby API GitHub z limitami zapytań i na repozytorium.
pt_br: Contexto remoto do GitHub: Issues, PRs ou outros recursos da API do GitHub com consulta e limites por repositório.
ru: Удалённый контекст GitHub: задачи, PR или другие ресурсы API GitHub с запросами и лимитами на репозиторий.
tr: GitHub uzak bağlamı: Sorunlar, PR'ler veya sorgu ve depo başına limitleri olan diğer GitHub API kaynakları.
uk: Віддалений контекст GitHub: Issues, PR або інші ресурси API GitHub із запитами та обмеженнями на репозиторій.
vi: Ngữ cảnh từ xa GitHub: Issues, PRs hoặc các tài nguyên API GitHub khác với giới hạn truy vấn và mỗi kho.
zh_hans: GitHub 远程上下文：Issues、PR 等 GitHub API 资源及其查询词与每仓库上限。
zh_hant: GitHub 遠端上下文：Issues、PR 等 GitHub API 資源及其查詢詞與每倉庫上限。

# rag.workspace.inspector.plan.help.networkPlan.field.webSearch
source: Web search: public internet queries when enabled in Composer and approved by the Planner.
ar: بحث الويب: استعلامات الإنترنت العامة عند التمكين في Composer وموافقة المخطط.
de: Websuche: öffentliche Internetabfragen, wenn im Composer aktiviert und vom Planner genehmigt.
es: Búsqueda web: consultas a internet público cuando está habilitada en Composer y aprobada por el planificador.
fr: Recherche web : requêtes internet publiques lorsque activée dans Composer et approuvée par le planificateur.
id: Pencarian web: kueri internet publik saat diaktifkan di Composer dan disetujui oleh Planner.
it: Ricerca web: query su internet pubblico quando abilitata in Composer e approvata dal Planner.
ja: Web検索: Composerで有効化され、プランナーが承認した場合の公開インターネットクエリ。
ko: 웹 검색: Composer에서 활성화되고 Planner가 승인한 경우의 공개 인터넷 쿼리입니다.
nl: Webzoekopdracht: openbare internetquery's wanneer ingeschakeld in Composer en goedgekeurd door de Planner.
pl: Wyszukiwanie w sieci: zapytania do publicznego internetu, gdy włączone w Composer i zatwierdzone przez Planistę.
pt_br: Busca na web: consultas à internet pública quando habilitadas no Composer e aprovadas pelo Planejador.
ru: Веб-поиск: запросы к публичному интернету, если включено в Composer и одобрено планировщиком.
tr: Web araması: Composer'da etkinleştirildiğinde ve Planlayıcı tarafından onaylandığında genel internet sorguları.
uk: Веб-пошук: запити до публічного інтернету, якщо це ввімкнено в Composer і схвалено планувальником.
vi: Tìm kiếm web: truy vấn internet công cộng khi được bật trong Composer và được Planner chấp thuận.
zh_hans: 互联网搜索：Composer 已开启联网且 Planner 认为需要时，发起的公开网页检索。
zh_hant: 網際網路搜尋：Composer 已開啟聯網且 Planner 認為需要時，發起的公開網頁檢索。

# rag.workspace.inspector.plan.help.networkPlan.fields.title
source: Fields in this section
ar: الحقول في هذا القسم
de: Felder in diesem Abschnitt
es: Campos en esta sección
fr: Champs de cette section
id: Bidang di bagian ini
it: Campi in questa sezione
ja: このセクションのフィールド
ko: 이 섹션의 필드
nl: Velden in deze sectie
pl: Pola w tej sekcji
pt_br: Campos nesta seção
ru: Поля в этом разделе
tr: Bu bölümdeki alanlar
uk: Поля цього розділу
vi: Các trường trong phần này
zh_hans: 本节字段含义
zh_hant: 本節欄位含義

# rag.workspace.inspector.plan.help.networkPlan.open
source: Learn about network plan
ar: تعلّم حول خطة الشبكة
de: Mehr über den Netzwerkplan erfahren
es: Más información sobre el plan de red
fr: En savoir plus sur le plan réseau
id: Pelajari tentang rencana jaringan
it: Scopri il piano di rete
ja: ネットワーク計画について
ko: 네트워크 계획 알아보기
nl: Meer over netwerkplan
pl: Dowiedz się o planie sieciowym
pt_br: Saiba mais sobre plano de rede
ru: Узнать о сетевом плане
tr: Ağ planı hakkında bilgi edinin
uk: Дізнатися про мережевий план
vi: Tìm hiểu về kế hoạch mạng
zh_hans: 了解联网计划
zh_hant: 了解聯網計劃

# rag.workspace.inspector.plan.help.networkPlan.title
source: Network plan
ar: خطة الشبكة
de: Netzwerkplan
es: Plan de red
fr: Plan réseau
id: Rencana jaringan
it: Piano di rete
ja: ネットワーク計画
ko: 네트워크 계획
nl: Netwerkplan
pl: Plan sieciowy
pt_br: Plano de rede
ru: Сетевой план
tr: Ağ planı
uk: Мережевий план
vi: Kế hoạch mạng
zh_hans: 联网计划
zh_hant: 聯網計劃

# rag.workspace.inspector.plan.help.questionUnderstanding.definition.body
source: The Planner model's interpretation of your question before retrieval runs. It shows what Starcat believes you are asking and how it will search semantically.
ar: تفسير نموذج المخطط لسؤالك قبل تشغيل الاسترجاع. يظهر ما تعتقد Starcat أنك تسأل عنه وكيف ستبحث دلاليًا.
de: Die Interpretation Ihrer Frage durch das Planner-Modell vor dem Abruf. Es zeigt, was Starcat Ihrer Meinung nach fragt und wie es semantisch suchen wird.
es: La interpretación del modelo planificador de su pregunta antes de ejecutar la recuperación. Muestra lo que Starcat cree que está preguntando y cómo buscará semánticamente.
fr: L'interprétation de votre question par le modèle planificateur avant l'exécution de la récupération. Il montre ce que Starcat pense que vous demandez et comment il effectuera la recherche sémantique.
id: Interpretasi model Planner terhadap pertanyaan Anda sebelum pengambilan dijalankan. Ini menunjukkan apa yang Starcat yakini Anda tanyakan dan bagaimana ia akan mencari secara semantik.
it: L'interpretazione del modello Planner della tua domanda prima dell'esecuzione del recupero. Mostra cosa Starcat pensa tu stia chiedendo e come effettuerà la ricerca semantica.
ja: 検索実行前のプランナーモデルによる質問の解釈。Starcatが何を尋ねられていると認識し、どのようにセマンティック検索するかを示します。
ko: 검색 실행 전 Planner 모델의 질문 해석입니다. Starcat이 사용자가 무엇을 묻고 있는지, 어떻게 의미론적으로 검색할지 보여줍니다.
nl: De interpretatie van je vraag door het Plannermodel voordat het ophalen wordt uitgevoerd. Het toont wat Starcat denkt dat je vraagt en hoe het semantisch zal zoeken.
pl: Interpretacja pytania przez model Planisty przed uruchomieniem wyszukiwania. Pokazuje, co według Starcat pytasz i jak będzie szukać semantycznie.
pt_br: A interpretação do modelo Planejador sobre sua pergunta antes da execução da recuperação. Mostra o que o Starcat acredita que você está perguntando e como fará a busca semântica.
ru: Интерпретация вашего вопроса моделью планировщика до выполнения поиска. Показывает, что, по мнению Starcat, вы спрашиваете и как будет выполнять семантический поиск.
tr: Planlayıcı modelinin, getirme işlemi çalışmadan önce sorunuzu yorumlaması. Starcat'ın ne sorduğunuzu düşündüğünü ve anlamsal olarak nasıl arama yapacağını gösterir.
uk: Інтерпретація вашого питання моделлю планувальника до виконання пошуку. Показує, що, на думку Starcat, ви запитуєте, і як він шукатиме семантично.
vi: Diễn giải câu hỏi của bạn bởi mô hình Planner trước khi truy xuất. Nó cho thấy Starcat nghĩ bạn đang hỏi gì và cách nó sẽ tìm kiếm ngữ nghĩa.
zh_hans: 检索执行前，Planner 模型对你问题的理解结果：展示 Starcat 认为你在问什么，以及将如何改写为语义检索。
zh_hant: 檢索執行前，Planner 模型對你問題的理解結果：展示 Starcat 認為你在問什麼，以及將如何改寫為語義檢索。

# rag.workspace.inspector.plan.help.questionUnderstanding.definition.title
source: What is question understanding?
ar: ما هو فهم السؤال؟
de: Was ist das Fragenverständnis?
es: ¿Qué es la comprensión de la pregunta?
fr: Qu'est-ce que la compréhension de la question ?
id: Apa itu pemahaman pertanyaan?
it: Cos'è la comprensione della domanda?
ja: 質問理解とは？
ko: 질문 이해란 무엇인가요?
nl: Wat is vraagbegrip?
pl: Co to jest zrozumienie pytania?
pt_br: O que é compreensão da pergunta?
ru: Что такое понимание вопроса?
tr: Soru anlama nedir?
uk: Що таке розуміння питання?
vi: Hiểu câu hỏi là gì?
zh_hans: 问题理解是什么？
zh_hant: 什麼是問題理解？

# rag.workspace.inspector.plan.help.questionUnderstanding.field.originalQuestion
source: Original question: the text you sent from Composer.
ar: السؤال الأصلي: النص الذي أرسلته من Composer.
de: Ursprüngliche Frage: der Text, den Sie vom Composer gesendet haben.
es: Pregunta original: el texto que envió desde Composer.
fr: Question originale : le texte que vous avez envoyé depuis Composer.
id: Pertanyaan asli: teks yang Anda kirim dari Composer.
it: Domanda originale: il testo inviato da Composer.
ja: 元の質問: Composerから送信したテキスト。
ko: 원래 질문: Composer에서 보낸 텍스트입니다.
nl: Oorspronkelijke vraag: de tekst die je vanuit Composer hebt verzonden.
pl: Oryginalne pytanie: tekst wysłany z Composera.
pt_br: Pergunta original: o texto que você enviou do Composer.
ru: Исходный вопрос: текст, отправленный из Composer.
tr: Orijinal soru: Composer'dan gönderdiğiniz metin.
uk: Оригінальне питання: текст, який ви надіслали з Composer.
vi: Câu hỏi gốc: văn bản bạn đã gửi từ Composer.
zh_hans: 原始问题：你在 Composer 发送的原文。
zh_hant: 原始問題：你在 Composer 發送的原文。

# rag.workspace.inspector.plan.help.questionUnderstanding.field.planningNotes
source: Plan notes: short AI-generated explanations (up to 3) of what Starcat will do next.
ar: ملاحظات الخطة: تفسيرات قصيرة مولدة بالذكاء الاصطناعي (حتى 3) لما ستفعله Starcat بعد ذلك.
de: Planhinweise: kurze KI-generierte Erklärungen (bis zu 3), was Starcat als Nächstes tun wird.
es: Notas del plan: breves explicaciones generadas por IA (hasta 3) de lo que Starcat hará a continuación.
fr: Notes de plan : courtes explications générées par l'IA (jusqu'à 3) de ce que Starcat fera ensuite.
id: Catatan rencana: penjelasan singkat buatan AI (hingga 3) tentang apa yang akan dilakukan Starcat selanjutnya.
it: Note di piano: brevi spiegazioni generate dall'IA (fino a 3) di cosa farà Starcat successivamente.
ja: 計画ノート: Starcatが次に行うことの短いAI生成説明（最大3つ）。
ko: 계획 노트: Starcat이 다음에 수행할 작업에 대한 짧은 AI 생성 설명(최대 3개)입니다.
nl: Plannotities: korte AI-gegenereerde uitleg (maximaal 3) over wat Starcat vervolgens gaat doen.
pl: Notatki planu: krótkie wyjaśnienia generowane przez AI (do 3) o tym, co Starcat zrobi dalej.
pt_br: Notas do plano: explicações curtas geradas por IA (até 3) do que o Starcat fará em seguida.
ru: Заметки плана: короткие пояснения, созданные ИИ (до 3), о том, что Starcat будет делать дальше.
tr: Plan notları: Starcat'ın bundan sonra ne yapacağına dair kısa yapay zeka kaynaklı açıklamalar (en fazla 3).
uk: Нотатки плану: короткі пояснення, створені ШІ (до 3), про те, що Starcat робитиме далі.
vi: Ghi chú kế hoạch: giải thích ngắn do AI tạo (tối đa 3) về những gì Starcat sẽ làm tiếp theo.
zh_hans: 规划说明：Planner 生成的简短说明（最多 3 条），描述接下来打算做什么。
zh_hant: 規劃說明：Planner 生成的簡短說明（最多 3 條），描述接下來打算做什麼。

# rag.workspace.inspector.plan.help.questionUnderstanding.field.semanticQuery
source: Semantic query: Planner-rewritten keywords used for vector and keyword retrieval.
ar: الاستعلام الدلالي: كلمات مفتاحية معاد كتابتها بواسطة المخطط تُستخدم لاسترجاع المتجهات والكلمات المفتاحية.
de: Semantische Abfrage: vom Planner umgeschriebene Schlüsselwörter für die Vektor- und Stichwortsuche.
es: Consulta semántica: palabras clave reescritas por el planificador utilizadas para la recuperación vectorial y por palabras clave.
fr: Requête sémantique : mots-clés reformulés par le planificateur utilisés pour la récupération vectorielle et par mots-clés.
id: Kueri semantik: kata kunci yang ditulis ulang oleh Planner yang digunakan untuk pengambilan vektor dan kata kunci.
it: Query semantica: parole chiave riscritte dal Planner utilizzate per il recupero vettoriale e per parole chiave.
ja: セマンティッククエリ: ベクトル検索とキーワード検索に使用される、プランナーが書き換えたキーワード。
ko: 의미론적 쿼리: 벡터 및 키워드 검색에 사용되는 Planner가 재작성한 키워드입니다.
nl: Semantische query: door de Planner herschreven trefwoorden die worden gebruikt voor vector- en trefwoordzoekopdrachten.
pl: Zapytanie semantyczne: słowa kluczowe przepisane przez Planistę do wyszukiwania wektorowego i słów kluczowych.
pt_br: Consulta semântica: palavras-chave reescritas pelo Planejador usadas para recuperação vetorial e por palavras-chave.
ru: Семантический запрос: переписанные планировщиком ключевые слова для векторного и ключевого поиска.
tr: Anlamsal sorgu: Vektör ve anahtar kelime getirmesi için kullanılan, Planlayıcı tarafından yeniden yazılmış anahtar kelimeler.
uk: Семантичний запит: переписані планувальником ключові слова для векторного та ключового пошуку.
vi: Truy vấn ngữ nghĩa: từ khóa được Planner viết lại dùng cho truy xuất vector và từ khóa.
zh_hans: 语义查询：Planner 改写后的检索词，用于向量与关键词召回。
zh_hant: 語義查詢：Planner 改寫後的檢索詞，用於向量與關鍵詞召回。

# rag.workspace.inspector.plan.help.questionUnderstanding.fields.title
source: Fields in this section
ar: الحقول في هذا القسم
de: Felder in diesem Abschnitt
es: Campos en esta sección
fr: Champs de cette section
id: Bidang di bagian ini
it: Campi in questa sezione
ja: このセクションのフィールド
ko: 이 섹션의 필드
nl: Velden in deze sectie
pl: Pola w tej sekcji
pt_br: Campos nesta seção
ru: Поля в этом разделе
tr: Bu bölümdeki alanlar
uk: Поля цього розділу
vi: Các trường trong phần này
zh_hans: 本节字段含义
zh_hant: 本節欄位含義

# rag.workspace.inspector.plan.help.questionUnderstanding.open
source: Learn about question understanding
ar: تعلّم حول فهم السؤال
de: Mehr über das Fragenverständnis erfahren
es: Más información sobre la comprensión de la pregunta
fr: En savoir plus sur la compréhension de la question
id: Pelajari tentang pemahaman pertanyaan
it: Scopri la comprensione della domanda
ja: 質問理解について
ko: 질문 이해 알아보기
nl: Meer over vraagbegrip
pl: Dowiedz się o zrozumieniu pytania
pt_br: Saiba mais sobre compreensão da pergunta
ru: Узнать о понимании вопроса
tr: Soru anlama hakkında bilgi edinin
uk: Дізнатися про розуміння питання
vi: Tìm hiểu về hiểu câu hỏi
zh_hans: 了解问题理解
zh_hant: 了解問題理解

# rag.workspace.inspector.plan.help.questionUnderstanding.title
source: Question understanding
ar: فهم السؤال
de: Fragenverständnis
es: Comprensión de la pregunta
fr: Compréhension de la question
id: Pemahaman pertanyaan
it: Comprensione della domanda
ja: 質問理解
ko: 질문 이해
nl: Vraagbegrip
pl: Zrozumienie pytania
pt_br: Compreensão da pergunta
ru: Понимание вопроса
tr: Soru anlama
uk: Розуміння запитання
vi: Hiểu câu hỏi
zh_hans: 问题理解
zh_hant: 問題理解

# rag.workspace.inspector.plan.help.repoContext.definition.body
source: Used only when Composer enables Deep Thinking with exactly one selected project. Starcat analyzes that repository's source tree, builds a context.xml, and injects it into the Generator prompt as {repoContextSection}. It does not run when Deep Thinking is off or when zero/multiple projects are selected.
ar: يُستخدم فقط عندما يُمكّن Composer ميزة التفكير العميق مع تحديد مشروع واحد بالضبط. يحلل Starcat شجرة المصدر لذلك المستودع، ويبني context.xml، ويحقنه في موجه المولّد كـ {repoContextSection}. لا يعمل عند إيقاف التفكير العميق أو عند تحديد صفر/عدة مشاريع.
de: Wird nur verwendet, wenn Composer Deep Thinking mit genau einem ausgewählten Projekt aktiviert. Starcat analysiert den Quellbaum dieses Repositorys, erstellt eine context.xml und fügt sie als {repoContextSection} in den Generator-Prompt ein. Es wird nicht ausgeführt, wenn Deep Thinking deaktiviert ist oder null/mehrere Projekte ausgewählt sind.
es: Se usa solo cuando Composer activa Deep Thinking con exactamente un proyecto seleccionado. Starcat analiza el árbol fuente de ese repositorio, construye un context.xml y lo inyecta en el prompt del Generador como {repoContextSection}. No se ejecuta cuando Deep Thinking está desactivado o cuando hay cero o múltiples proyectos seleccionados.
fr: Utilisé uniquement lorsque Composer active la réflexion approfondie avec exactement un projet sélectionné. Starcat analyse l'arborescence source de ce dépôt, construit un context.xml et l'injecte dans l'invite du générateur sous forme de {repoContextSection}. Il ne s'exécute pas lorsque la réflexion approfondie est désactivée ou qu'aucun ou plusieurs projets sont sélectionnés.
id: Digunakan hanya saat Composer mengaktifkan Deep Thinking dengan tepat satu proyek yang dipilih. Starcat menganalisis pohon sumber repositori tersebut, membangun context.xml, dan menyuntikkannya ke dalam prompt Generator sebagai {repoContextSection}. Tidak berjalan saat Deep Thinking mati atau saat nol/banyak proyek dipilih.
it: Usato solo quando Composer abilita Deep Thinking con esattamente un progetto selezionato. Starcat analizza l'albero sorgente di quel repository, costruisce un context.xml e lo inietta nel prompt del Generatore come {repoContextSection}. Non viene eseguito quando Deep Thinking è disattivato o quando sono selezionati zero o più progetti.
ja: ComposerでDeep Thinkingが有効で、かつプロジェクトが1つだけ選択されている場合にのみ使用されます。Starcatはそのリポジトリのソースツリーを分析し、context.xmlを構築し、{repoContextSection}としてジェネレータープロンプトに注入します。Deep Thinkingがオフの場合や、プロジェクトが0または複数選択されている場合は実行されません。
ko: Composer에서 Deep Thinking이 활성화되고 정확히 하나의 프로젝트가 선택된 경우에만 사용됩니다. Starcat는 해당 저장소의 소스 트리를 분석하고 context.xml을 빌드한 후, 이를 Generator 프롬프트에 {repoContextSection}으로 주입합니다. Deep Thinking이 꺼져 있거나 프로젝트가 0개/여러 개 선택된 경우에는 실행되지 않습니다.
nl: Alleen gebruikt wanneer Composer Diep Denken inschakelt met precies één geselecteerd project. Starcat analyseert de bronboom van die repository, bouwt een context.xml en injecteert deze in de Generator-prompt als {repoContextSection}. Het wordt niet uitgevoerd wanneer Diep Denken uit staat of wanneer nul/meerdere projecten zijn geselecteerd.
pl: Używane tylko, gdy Composer włączy Głębokie myślenie z dokładnie jednym wybranym projektem. Starcat analizuje drzewo źródłowe tego repozytorium, buduje plik context.xml i wstrzykuje go do promptu Generatora jako {repoContextSection}. Nie uruchamia się, gdy Głębokie myślenie jest wyłączone lub gdy wybrano zero/wiele projektów.
pt_br: Usado apenas quando o Composer ativa o Pensamento Profundo com exatamente um projeto selecionado. O Starcat analisa a árvore de código-fonte desse repositório, cria um context.xml e o injeta no prompt do Gerador como {repoContextSection}. Não é executado quando o Pensamento Profundo está desativado ou quando zero ou vários projetos estão selecionados.
ru: Используется только когда Composer включает глубокое мышление ровно с одним выбранным проектом. Starcat анализирует дерево исходников этого репозитория, строит context.xml и внедряет его в промпт Генератора как {repoContextSection}. Не выполняется, если глубокое мышление выключено или выбрано ноль/несколько проектов.
tr: Yalnızca Composer, tam olarak bir seçili projeyle Derin Düşünme'yi etkinleştirdiğinde kullanılır. Starcat, o deponun kaynak ağacını analiz eder, bir context.xml oluşturur ve bunu {repoContextSection} olarak Generator istemine enjekte eder. Derin Düşünme kapalıyken veya sıfır/çoklu proje seçiliyken çalışmaz.
uk: Використовується лише тоді, коли Composer увімкнено глибоке мислення з рівно одним вибраним проєктом. Starcat аналізує дерево вихідного коду цього репозиторію, створює context.xml і вставляє його в підказку генератора як {repoContextSection}. Не виконується, коли глибоке мислення вимкнено або вибрано нуль чи кілька проєктів.
vi: Chỉ được sử dụng khi Composer bật Deep Thinking với đúng một dự án được chọn. Starcat phân tích cây nguồn của kho lưu trữ đó, xây dựng context.xml và chèn nó vào lời nhắc Generator dưới dạng {repoContextSection}. Nó không chạy khi Deep Thinking tắt hoặc khi không có/nhiều dự án được chọn.
zh_hans: 仅在 Composer 开启「深度思考」且恰好选中 1 个项目时使用。Starcat 会分析该仓库源码树，生成 context.xml，并作为 {repoContextSection} 注入 Generator Prompt。未开启深度思考，或未选 / 多选项目时不会走这条链路。
zh_hant: 僅在 Composer 開啟「深度思考」且恰好選中 1 個項目時使用。Starcat 會分析該倉庫源碼樹，生成 context.xml，並作為 {repoContextSection} 注入 Generator Prompt。未開啟深度思考，或未選 / 多選項目時不會走這條鏈路。

# rag.workspace.inspector.plan.help.repoContext.definition.title
source: What is project code?
ar: ما هو كود المشروع؟
de: Was ist Projektcode?
es: ¿Qué es el código del proyecto?
fr: Qu'est-ce que le code projet ?
id: Apa itu kode proyek?
it: Cos'è il codice del progetto?
ja: プロジェクトコードとは？
ko: 프로젝트 코드란 무엇인가요?
nl: Wat is projectcode?
pl: Co to jest kod projektu?
pt_br: O que é código do projeto?
ru: Что такое код проекта?
tr: Proje kodu nedir?
uk: Що таке код проєкту?
vi: Mã dự án là gì?
zh_hans: 项目代码是什么？
zh_hant: 什麼是項目代碼？

# rag.workspace.inspector.plan.help.repoContext.field.budget
source: Token budget: the packer budget from Settings used when building XML.
ar: ميزانية الرموز: ميزانية الحزم من الإعدادات المستخدمة عند بناء XML.
de: Token-Budget: das Packer-Budget aus den Einstellungen, das beim Erstellen der XML verwendet wird.
es: Presupuesto de tokens: el presupuesto del empaquetador de Configuración usado al construir el XML.
fr: Budget de jetons : le budget de conditionnement des paramètres utilisé lors de la construction du XML.
id: Anggaran token: anggaran packer dari Pengaturan yang digunakan saat membangun XML.
it: Budget di token: il budget di compressione dalle Impostazioni usato durante la creazione dell'XML.
ja: トークン予算: XML構築時に使用される、設定からのパッカーバジェット。
ko: 토큰 예산: XML 빌드 시 사용되는 설정의 패커 예산입니다.
nl: Tokenbudget: het packerbudget uit Instellingen dat wordt gebruikt bij het bouwen van XML.
pl: Budżet tokenów: budżet pakera z Ustawień używany podczas budowania XML.
pt_br: Orçamento de tokens: o orçamento do empacotador das Configurações usado ao criar o XML.
ru: Токен-бюджет: бюджет упаковщика из настроек, используемый при построении XML.
tr: Token bütçesi: XML oluşturulurken Ayarlar'dan alınan paketleyici bütçesi.
uk: Бюджет токенів: бюджет пакувальника з налаштувань, який використовується під час створення XML.
vi: Ngân sách token: ngân sách đóng gói từ Cài đặt được sử dụng khi xây dựng XML.
zh_hans: Token 预算：设置中的打包预算，用于生成 XML。
zh_hant: Token 預算：設定中的打包預算，用於生成 XML。

# rag.workspace.inspector.plan.help.repoContext.field.cache
source: Preparation: reused an existing cache or generated XML this turn.
ar: التحضير: إعادة استخدام ذاكرة تخزين مؤقت موجودة أو توليد XML في هذا الدور.
de: Vorbereitung: Wiederverwendung eines vorhandenen Caches oder XML-Erstellung in diesem Durchlauf.
es: Preparación: reutilizó una caché existente o generó XML en esta ronda.
fr: Préparation : a réutilisé un cache existant ou généré du XML ce tour-ci.
id: Persiapan: menggunakan cache yang ada atau menghasilkan XML pada giliran ini.
it: Preparazione: riutilizzata una cache esistente o generato XML in questo turno.
ja: 準備: 既存のキャッシュを再利用したか、今回新たにXMLを生成したか。
ko: 준비: 기존 캐시를 재사용했거나 이번 턴에 XML을 생성했습니다.
nl: Voorbereiding: een bestaande cache hergebruikt of deze keer XML gegenereerd.
pl: Przygotowanie: użyto istniejącego cache lub wygenerowano XML w tej turze.
pt_br: Preparação: reutilizou um cache existente ou gerou XML neste turno.
ru: Подготовка: использован существующий кеш или сгенерирован XML в этом раунде.
tr: Hazırlık: bu turda mevcut bir önbellek yeniden kullanıldı veya XML oluşturuldu.
uk: Підготовка: використано наявний кеш або згенеровано XML цього разу.
vi: Chuẩn bị: đã sử dụng lại bộ nhớ đệm hiện có hoặc tạo XML trong lượt này.
zh_hans: 生成方式：复用已有缓存，或本轮重新生成 XML。
zh_hant: 生成方式：複用已有快取，或本輪重新生成 XML。
